---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexPosition Properties
VertexPosition Class See Also Send Feedback
---

The VertexPosition type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Vertex.) |
|  | Position | The vertex's position. |

# See Also

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace